[
    {
        "_id": "655bffa32f18089b362bdaf3",
        "orgName": "Urban Threads Botique",
        "userLocation": "Melbourne, Australia",
        "biography": "Urban Threads Boutique is a fashion haven nestled in the heart of Melbourne. As a boutique retailer, we curate a diverse collection of clothing and accessories that reflect the latest trends and timeless styles. Our commitment to providing a personalized shopping experience sets us apart, making Urban Threads a go-to destination for those seeking unique and fashionable finds. Urban Threads Boutique is a fashion haven nestled in the heart of Melbourne. As a boutique retailer, we curate a diverse collection of clothing and accessories that reflect the latest trends and timeless styles. Our commitment to providing a personalized shopping experience sets us apart, making Urban Threads a go-to destination for those seeking unique and fashionable finds.",
        "industry": "Retail",
        "isOrganisation": true,
        "password": "basicOrganisation213",
        "email": "basicOrganisation213@gmail.com",
        "profilePicture": "https://99designs-blog.imgix.net/blog/wp-content/uploads/2017/02/Untd-Fashion-Logo.png?auto=format&q=60&fit=max&w=930"
    },
    {
        "_id": "655bfff51666d44921dfa645",
        "orgName": "Coastal Breeze Resort",
        "userLocation": "Gold Coast, Australia",
        "biography": "Coastal Breeze Resort, located on the picturesque Gold Coast, is a luxurious escape that blends relaxation with coastal charm. As a hospitality haven, we pride ourselves on offering impeccable service and creating unforgettable experiences for our guests. From beachside retreats to gourmet dining, Coastal Breeze Resort is a sanctuary for those seeking the epitome of seaside luxury. Coastal Breeze Resort, located on the picturesque Gold Coast, is a luxurious escape that blends relaxation with coastal charm. As a hospitality haven, we pride ourselves on offering impeccable service and creating unforgettable experiences for our guests. From beachside retreats to gourmet dining, Coastal Breeze Resort is a sanctuary for those seeking the epitome of seaside luxury.",
        "industry": "Hospitality",
        "isOrganisation": true,
        "password": "basicOrganisation213",
        "email": "basicOrganisation2134@gmail.com",
        "profilePicture": "https://www.designevo.com/res/templates/thumb_small/coconut-tree-and-tropical-resort.webp"
    },
    {
        "_id": "655c00b13a748f35dfe6130b",
        "orgName": "Green Fields Agro",
        "userLocation": "Adelaide, Australia",
        "biography": "Green Fields Agro is a family-owned farm nestled in the fertile lands surrounding Adelaide. Specializing in sustainable agriculture, we cultivate a variety of crops using eco-friendly practices. Our commitment to providing fresh, locally sourced produce to the community is at the heart of our mission. Green Fields Agro stands as a testament to the harmonious coexistence of agriculture and environmental stewardship. Green Fields Agro is a family-owned farm nestled in the fertile lands surrounding Adelaide. Specializing in sustainable agriculture, we cultivate a variety of crops using eco-friendly practices. Our commitment to providing fresh, locally sourced produce to the community is at the heart of our mission. Green Fields Agro stands as a testament to the harmonious coexistence of agriculture and environmental stewardship.",
        "industry": "Agriculture",
        "isOrganisation": true,
        "password": "basicOrganisation213",
        "email": "basicOrganisatio34@gmail.com",
        "profilePicture": "https://t4.ftcdn.net/jpg/03/24/10/97/360_F_324109791_jOqeA75fb7WbPjz13D9jxSg6YnTozIcY.jpg"
    },
    {
        "_id": "655c011319b34b5474f4b3e0",
        "orgName": "Nexus Learning Center",
        "userLocation": "Sydney, Australia",
        "biography": "Nexus Learning Center, situated in Sydney, is an educational institution dedicated to nurturing minds and fostering lifelong learning. Our innovative approach to education combines traditional principles with modern teaching methodologies. From early childhood development to professional training, Nexus Learning Center is committed to empowering individuals to reach their full potential in an ever-evolving world. Nexus Learning Center, situated in Sydney, is an educational institution dedicated to nurturing minds and fostering lifelong learning. Our innovative approach to education combines traditional principles with modern teaching methodologies. From early childhood development to professional training, Nexus Learning Center is committed to empowering individuals to reach their full potential in an ever-evolving world.",
        "industry": "Education",
        "isOrganisation": true,
        "password": "basicOrganisation213",
        "email": "basicOrganisao34@gmail.com",
        "profilePicture": "https://static.vecteezy.com/system/resources/previews/004/870/601/original/simple-education-logo-design-template-book-icon-and-pencil-emblem-for-courses-classes-and-schools-illustration-online-education-e-book-business-company-library-store-and-learning-concept-free-vector.jpg"
    },
    {
        "_id": "655c017a42db72227e04f20f",
        "orgName": "Aussie Expeditions",
        "userLocation": "Brisbane, Australia",
        "biography": "Aussie Expeditions is a premier tourism company based in Brisbane, inviting adventurers to explore the diverse landscapes of Australia. From guided hikes through lush rainforests to thrilling outback safaris, we curate experiences that showcase the natural beauty and cultural richness of the continent. Aussie Expeditions is not just a travel company; it's a gateway to unforgettable journeys and lasting memories. Aussie Expeditions is a premier tourism company based in Brisbane, inviting adventurers to explore the diverse landscapes of Australia. From guided hikes through lush rainforests to thrilling outback safaris, we curate experiences that showcase the natural beauty and cultural richness of the continent. Aussie Expeditions is not just a travel company; it's a gateway to unforgettable journeys and lasting memories.",
        "industry": "Tourism",
        "isOrganisation": true,
        "password": "basicOrganisation213",
        "email": "basicOrganisao123134@gmail.com",
        "profilePicture": "https://img.freepik.com/premium-vector/kangaroo-logo-vector-design-australian-animal-kangaroo_605910-2663.jpg"
    },
    {
        "_id": "655c01f8f2360357643f6a06",
        "orgName": "Metro Movers",
        "userLocation": "Sydney, Australia",
        "biography": "Metro Movers is a dynamic transportation company operating in the bustling city of Sydney. Specializing in efficient and reliable logistics, we provide a range of transportation services, from cargo deliveries to executive chauffeur services. Our commitment to punctuality, professionalism, and customer satisfaction makes Metro Movers the preferred choice for businesses and individuals alike in the fast-paced urban landscape. Metro Movers is a dynamic transportation company operating in the bustling city of Sydney. Specializing in efficient and reliable logistics, we provide a range of transportation services, from cargo deliveries to executive chauffeur services. Our commitment to punctuality, professionalism, and customer satisfaction makes Metro Movers the preferred choice for businesses and individuals alike in the fast-paced urban landscape.",
        "industry": "Transportation",
        "isOrganisation": true,
        "password": "basicOrganisation213",
        "email": "basicOrganisao123132414214@gmail.com",
        "profilePicture": "https://cdn.dribbble.com/userupload/10274400/file/original-e3fa9c4057d2038489d021e0eae8a66b.png?resize=400x0"
    },
    {
        "_id": "655c027323a615c3bcac024a",
        "orgName": "City Threads Emporium",
        "userLocation": "New York City, New York, USA",
        "biography": "City Threads Emporium is a vibrant retail destination located in the heart of New York City. As purveyors of urban fashion, we curate a diverse collection that reflects the eclectic style of the city. From streetwear to high fashion, City Threads Emporium is a cultural hub where fashion-forward individuals can explore and express their unique sense of style. City Threads Emporium is a vibrant retail destination located in the heart of New York City. As purveyors of urban fashion, we curate a diverse collection that reflects the eclectic style of the city. From streetwear to high fashion, City Threads Emporium is a cultural hub where fashion-forward individuals can explore and express their unique sense of style.",
        "industry": "Retail",
        "isOrganisation": true,
        "password": "basicOrganisation213",
        "email": "basicOrganisao123132151242321314@gmail.com",
        "profilePicture": "https://static.vecteezy.com/system/resources/thumbnails/019/278/346/small/speed-shop-and-shopping-logo-design-element-unique-shopping-and-retail-logo-template-free-vector.jpg"
    },
    {
        "_id": "655c03061438bdb152bb4e62",
        "orgName": "Riverside Retreat Inn",
        "userLocation": "San Francisco, California, USA",
        "biography": "Riverside Retreat Inn, nestled along the scenic landscapes of San Francisco, is a boutique hotel dedicated to providing a tranquil escape. Our hospitality ethos revolves around personalized service, luxurious accommodations, and a commitment to creating a home away from home for our guests. Riverside Retreat Inn is not just a place to stay; it's a sanctuary where every detail is crafted with care. Riverside Retreat Inn, nestled along the scenic landscapes of San Francisco, is a boutique hotel dedicated to providing a tranquil escape. Our hospitality ethos revolves around personalized service, luxurious accommodations, and a commitment to creating a home away from home for our guests. Riverside Retreat Inn is not just a place to stay; it's a sanctuary where every detail is crafted with care.",
        "industry": "Hospitality",
        "isOrganisation": true,
        "password": "basicOrganisation213",
        "email": "basicOrgan14@gmail.com",
        "profilePicture": "https://images-platform.99static.com//6b0zOITQWvNCKG7qITZg8sBRf-4=/0x0:2000x2000/fit-in/500x500/99designs-contests-attachments/131/131313/attachment_131313423"
    },
    {
        "_id": "655c038ba147feceb0270e10",
        "orgName": "Harvest Haven Farms",
        "userLocation": "Sacramento, California, USA",
        "biography": "Harvest Haven Farms, situated in the fertile valleys of Sacramento, is a sustainable agriculture venture rooted in traditional farming values. Our farm produces a bounty of fresh, organic crops, embracing eco-friendly practices to ensure the health of both the land and the community. Harvest Haven Farms is a testament to the harmonious coexistence of modern agriculture and environmental stewardship. Harvest Haven Farms, situated in the fertile valleys of Sacramento, is a sustainable agriculture venture rooted in traditional farming values. Our farm produces a bounty of fresh, organic crops, embracing eco-friendly practices to ensure the health of both the land and the community. Harvest Haven Farms is a testament to the harmonious coexistence of modern agriculture and environmental stewardship.",
        "industry": "Agriculture",
        "isOrganisation": true,
        "password": "basicOrganisation213",
        "email": "basicdakdOrgan14@gmail.com",
        "profilePicture": "https://marketplace.canva.com/EAE90Gv-JIg/1/0/1600w/canva-sun-farm-aRuyV-Iz118.jpg"
    },
    {
        "_id": "655c03dff537c3a17cd00bbe",
        "orgName": "Horizon Learning Institute",
        "userLocation": "Los Angeles, California, USA",
        "biography": "Horizon Learning Institute, located in the vibrant city of Los Angeles, is a dynamic educational institution committed to shaping the future of learning. Our innovative programs span from early childhood education to professional development, preparing individuals for success in a rapidly changing world. At Horizon Learning Institute, we believe that education is the key to unlocking limitless possibilities. Horizon Learning Institute, located in the vibrant city of Los Angeles, is a dynamic educational institution committed to shaping the future of learning. Our innovative programs span from early childhood education to professional development, preparing individuals for success in a rapidly changing world. At Horizon Learning Institute, we believe that education is the key to unlocking limitless possibilities.",
        "industry": "Education",
        "isOrganisation": true,
        "password": "basicOrganisation213",
        "email": "basicdakdOrgfaknan14@gmail.com",
        "profilePicture": "https://static.vecteezy.com/system/resources/previews/007/410/265/original/business-education-logo-design-vector.jpg"
    }
]